//
//  DataStore.swift
//  ContactList-SUI
//
//  Created by Денис Гиндулин on 08.01.2024.
//

final class DataStore {
    static let shared = DataStore()
    
    var ids = [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19
    ]
    
    var firstNames = [
        "Иван",
        "Пётр",
        "Василий",
        "Сергей",
        "Алексей",
        "Дмитрий",
        "Виктор",
        "Николай",
        "Олег",
        "Кирилл",
        "Семён",
        "Данила",
        "Фёдор",
        "Назар",
        "Захар",
        "Илья",
        "Филипп",
        "Денис",
        "Юрий",
        "Владимир"
    ]
    
    var lastNames = [
        "Иванов",
        "Петров",
        "Васильев",
        "Сергеев",
        "Алексеев",
        "Дмитриев",
        "Викторов",
        "Николаев",
        "Олегов",
        "Кириллов",
        "Семёнов",
        "Данилов",
        "Фёдоров",
        "Назаров",
        "Захаров",
        "Ильин",
        "Филиппов",
        "Денисов",
        "Юрьев",
        "Владимиров"
    ]
    
    var phoneNumbers = [
        "8(901)111-22-33",
        "8(902)444-55-66",
        "8(903)777-88-99",
        "8(904)110-20-30",
        "8(905)440-50-60",
        "8(906)770-80-90",
        "8(907)123-45-67",
        "8(908)765-43-21",
        "8(909)007-08-09",
        "8(910)001-02-03",
        "8(911)002-03-04",
        "8(912)003-04-05",
        "8(913)004-05-06",
        "8(914)005-06-07",
        "8(915)006-07-08",
        "8(916)007-08-09",
        "8(917)008-09-10",
        "8(918)009-10-11",
        "8(919)010-11-12",
        "8(920)011-12-13"
    ]
    
    var emails = [
        "abc@mail.ru",
        "def@gmail.com",
        "ghi@me.com",
        "jkl@gmail.com",
        "mno@me.com",
        "pqr@gmail.com",
        "stu@me.com",
        "vwx@gmail.com",
        "xyz@me.com",
        "how@gmail.com",
        "who@mail.ru",
        "iam@gmail.com",
        "what@me.com",
        "here@mail.ru",
        "there@gmail.com",
        "thom@me.com",
        "where@mail.ru",
        "one@gmail.com",
        "today@me.com",
        "two@mail.ru"
    ]
    
    private init() {}
}
